Revit 2026 API

# LabelUtilsGetFailureSeverityName Method

---

Gets the user-visible name for the Severity of a Warning

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetFailureSeverityName(
	FailureSeverity failureSeverity
)
```
```vb
Public Shared Function GetFailureSeverityName (
	failureSeverity As FailureSeverity
) As String
```
```cpp
public:
static String^ GetFailureSeverityName(
	FailureSeverity failureSeverity
)
```
```fsharp
static member GetFailureSeverityName :
        failureSeverity : FailureSeverity -> string
```

#### Parameters

failureSeverity FailureSeverity
     The Severity enum value

#### Return Value

String Returns the user-visible name for the Severity of a Warning.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

Autodesk.Revit.DB Namespace